import { NumberOne, NumberThree, NumberTwo } from "../icons/numbets";
import image1 from "../images/1.png";
import image2 from "../images/2.png";
import image3 from "../images/3.png";

import imageMob1 from "../images/1-mob.png";
import imageMob2 from "../images/2-mob.png";
import imageMob3 from "../images/3-mob.png";

export const premiumWhyItems = [
  {
    title: "Лучшая ставка",
    image: image1,
    imageMob: imageMob1,
    index: <NumberOne />,
    text: [
      "С премиум-доступом у тебя появляется возможность видеть не только стандартный прогноз на матч, но и альтернативный вариант ставки, который S Æ A-XI определяет как 'лучший.",
      "Эта 'лучшая' ставка тщательно определяется нашей нейросетью на основе все того же углубленного анализа данных, текущих тенденций и стратегических оценок, но уже с некоторыми дополнениями.",
      "Особенностью 'лучшей' ставки является не только повышенная вероятность проходимости, но и, чаще всего, более высокие коэффициенты, что делает ее идеальным выбором для тех, кто стремится к максимизации своих выигрышей.",
      "Эта функция премиум-подписки создана для того, чтобы предоставить тебе не просто дополнительный вариант для ставок, но и более выгодное и продуманное решение для каждого матча.",
    ],
  },
  {
    title: "Экономит время",
    image: image2,
    imageMob: imageMob2,
    index: <NumberTwo />,
    text: [
      "Далее, мы решили сэкономить твоё время и внедрили функцию быстрого просмотра 'лучшей ставки' прямо на страницах видов спорта, стран и лиг, где представлены краткие карточки матчей.",
      "Это означает, что теперь, с премиум-доступом, ты можешь сразу видеть рекомендуемую 'лучшую ставку' для каждого матча, не погружаясь в детали страницы матча.",
      "Такой подход экономит время и упрощает процесс выбора, позволяя быстро фильтровать матчи и определять, какие из них заслуживают детального изучения.",
      "Эта функция делает процесс ставок ещё более удобным и эффективным, обеспечивая преимущество в выборе наиболее перспективных ставок.",
    ],
  },
  {
    title: "Запрос прогноза",
    image: image3,
    imageMob: imageMob3,
    index: <NumberThree />,
    text: [
      "А ещё у тебя, как у премиум-пользователя, будет доступна уникальная привилегия – возможность запросить индивидуальный прогноз от S Æ A-XI на матчи непопулярных лиг, на которые изначально прогноз не предусматривался.",
      "Эта функция предоставляет возможность расширить горизонты ставок, включая в них события из менее известных лиг, которые часто остаются вне внимания общественности.",
      "Наша нейросеть, используя передовые аналитические инструменты, способна быстро сформировать качественный и обоснованный прогноз даже на наименее освещаемые матчи.",
      "Это значительно повышает уровень гибкости и персонализации сервиса, позволяя тебе извлекать выгоду из уникальных и малоизученных рынков ставок.",
    ],
  },
];
